# ชนิดข้อมูลแบบ Tuple
# - ประกอบด้วยข้อมูลหลายข้อมูล
# - ที่แต่ละข้อมูลมี index number กำกับ โดยเริ่มที่ 0 (มองจากซ้ายไปขวา) แต่เร่มที่ -1 (มองจากขวาไปซ้าย)
# - ทุกข้อมูล ไม่ ไม่ ไม่ สามารถเปลี่ยนค่าได้
# - ต้องเขียนอยู่ใน ( ???? )
# - เพิ่มข้อมูลได้ ลบข้อมูลออก ไม่ ไม่ ไม่ ได้
# - การเข้าถึงข้อมูลใน Tuple ใช้ index number เขียนใน [ ]
 
tupleData1 = (10, 20, 30, 40)
tupleData2 = (10, 20, 'สมชาย', True, [1, 2, 3])
print(tupleData1[2]) #เข้าถึงข้อมูล 30
print(tupleData1[-2]) #เข้าถึงข้อมูล 30
print('--------------------------')
print(tupleData2[3]) #เข้าถึงข้อมูล True
print(tupleData2[-2]) #เข้าถึงข้อมูล True
print('--------------------------')
print(tupleData2)
tupleData2[2] = 'สมหญิง' #****** ERROR ******