# ชนิดข้อมูลแบบ Set
# - ประกอบด้วยข้อมูลหลายข้อมูล
# - ต้องเขียนอยู่ใน { ??? }
# - ข้อมูลแบบ Set เราจะเก็บข้อมูลที่เหมือนกัน/ซ้ำกัน คือ ตัวเดียวกัน
# - ทุกข้อมูลสามารถเปลี่ยนค่าได้
# - ไม่มี index number กำกับข้อมูล จึงทำให้เป็นข้อมูลแบบไม่เรียงลำดับ

listData1 = [10, 20, 30, 40, 10]     # จะถือว่ามี 5 ข้อมูล
tupleData1 = (10, 20, 30, 40, 10)    # จะถือว่ามี 5 ข้อมูล
setData1 = {10, 20, 30, 40, 10}      # จะถือว่ามี 4 ข้อมูล

print(listData1)
print(tupleData1)
print(setData1)
print('-----------------')
for data in setData1:
    print(data)